# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   - **Only one challenge is mandatory, you can pick your favorite**
   - **Please always use relative paths to access the data**
  
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset.
Download the dataset from [here](https://drive.google.com/file/d/1Ycqn6b9vkBAhYRVo9LAiHxKtWaBoJLVi/view?usp=sharing) and place it in the data folder

#### First import the dataset into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv('../data/Temp_States.csv')

#### Print `temp`.

In [3]:
# your code here
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
Two objects, which could be categorical or string values.
One float64 type which is the temperature
"""

'\nTwo objects, which could be categorical or string values.\nOne float64 type which is the temperature\n'

#### Select the rows where state is New York.

In [6]:
# your code here
temp.loc[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
# your code here
avg_temp_nyc = temp.loc[temp['State'] == 'New York'].mean()
print(avg_temp_nyc)

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
# your code here
temp.loc[temp['Temperature'] >= 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
# your code here
temp.loc[temp['Temperature'] >= 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
# your code here
conditions = (temp['Temperature'] >= 15) & (temp['Temperature'] < 20)
temp['City'].loc[conditions]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [13]:
# your code here
pd.pivot_table(df, index=["State"], values=["Temperature"],aggfunc=[np.mean, np.std])
#paolo: thic cell give error- df is not defined- should be temp instead.
#paolo: make sure you run notebook from top to bottom before submitting
# using restart-kernel-and-run-all-cells

NameError: name 'df' is not defined

# [ONLY ONE MANDATORY]  Challenge 2

Download the dataset `employees` from [here](https://drive.google.com/file/d/1CYFlr1Gc-B6nM3LfNUHj0WDNlXnK2ALI/view?usp=sharing) and place it in the data folder.
Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [15]:
# your code here
employees = pd.read_csv('../data/Employee.csv')
#paolo: relative path, yes!

#### Explore the data types of the `employees` dataframe. Comment your results.

In [16]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [17]:
"""
There are five categorical values(Name does not represent a category) and two numeric values.
"""

'\nThere are five categorical values(Name does not represent a category) and two numeric values.\n'

#### What's the average salary in this company?

In [18]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [21]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [19]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [20]:
# your code here
employees["Name"].loc[employees["Salary"] == 30]

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [22]:
# your code here
employees.loc[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [23]:
# your code here
employees["Salary"].loc[employees["Name"] == "David"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [24]:
# your code here
employees.loc[employees["Title"]== "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [25]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [26]:
# Method 2
# your code here
employees.loc[0:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [27]:
# your code here
conditions = (employees["Title"] == "associate") & (employees["Salary"] > 55)
employees.loc[conditions]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [28]:
# your code here
pd.pivot_table(employees, index=["Years"], values=["Salary"], aggfunc=np.mean)

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [29]:
# your code here
pd.pivot_table(employees, index=["Title"], values=["Salary"], aggfunc=np.mean)

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [ ]:
# your code here

#### Is the mean salary different per gender?

In [30]:
# your code here
pd.pivot_table(employees, index=["Gender"], values=["Salary"], aggfunc=np.mean)

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [31]:
# your code here
pd.pivot_table(employees, index=["Department"], values=["Years", "Salary"], aggfunc=[np.min, np.mean, np.max])

             amin         mean             amax
           Salary Years Salary     Years Salary Years
Department
HR             30     2  45.00  4.666667     70     8
IT             30     1  48.75  4.500000     70     8
Sales          55     2  55.00  2.500000     55     3

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

In [32]:
#paolo: great work on this optional lab!

# [ONLY ONE MANDATORY] Challenge 3
Download the dataset `Orders` from [here](https://drive.google.com/file/d/1aG8-IFQXyAYGYBpVSRsiMG-XR0iDRVXN/view?usp=sharing) and place it in the data folder.
Load the `Orders` into a dataframe. Call the dataframe `Orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here